Satoru-Kutsuwada/PIC32Dev/FreeRTOS_CLICKER2.X/Source/vl53/usr_i2cMain.c
//=============================================================================
//
//=============================================================================
int32_t i2c_writeMulti(uint8_t address,uint8_t reg, uint8_t *dst, uint8_t count)
{
    uint8_t i;
    uint8_t dt;
    uint8_t status;
    int index;
    
    
    status = STATUS_OK ;    
    
  
    LOG_PRINT_I2C("i2c_writeMulti()\r\n");
    if( count > MAX_MULTI_CNT ){
        LOG_PRINT_I2C("Error I2CData Size Over");
        status = STATUS_FAIL;          
    }
    else{
        
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // I2C START
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        I2C_ON = 1;
        I2C_ACKDT =0;
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // データ設定
        //++++++++++++++++++++++++++++++++++++++++++++++++++

        i2c_data.address = address;
        i2c_data.index = reg;
        i2c_data.count = count;
        i2c_data.count_step = 0;
        i2c_data.restart_cnt = 0;
        i2c_data.op_type = I2C_WRITE_MULTI;
        i2c_data.status = I2C_STAT_START;
        i2c_data.error = I2C_NO_ERROR;

        for( i=0; i<count; i++ ){
            i2c_data.dt[i] = *dst;
            dst ++;
        }


        // 割込みフラグクリア
        I2C_BIF = 0;
        I2C_MIF = 0;

        // 割込みイネーブル
        I2C_BIE = 0;
        I2C_MIE = 0;
        
        
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // 処理
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        while( status == STATUS_OK ){
            //SetLogDataM( LOG_DISP_I2C_STAT, "STATUS",i2c_data.status,0,0,0);
            LOG_PRINT_I2C("WITE MULTI STATUS = %d, CON=%p, STAT=%x\r\n",i2c_data.status, (uint32_t)I2C_CON,(uint16_t)I2C_STAT );
            switch( i2c_data.status ){
                case I2C_STAT_START:
                    status = i2c_start();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_WITE_ADDRESS_TX;
                    }
                    break;
                case I2C_STAT_WITE_ADDRESS_TX:
                    status = i2c_write(i2c_data.address);
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_INDEX_TX;
                    }
                    break;
                case I2C_STAT_INDEX_TX:
                    status = i2c_write(i2c_data.index);
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_DATA_TX;
                    }
                    break;
                case I2C_STAT_DATA_TX:
                    if( i2c_data.count_step < i2c_data.count ){
                        dt = i2c_data.dt[i2c_data.count_step];
                        i2c_data.count_step ++;
                        status = i2c_write(dt);
                    }

                    if( status == STATUS_OK ){
                        if( i2c_data.count_step >= i2c_data.count ){
                            i2c_data.status = I2C_STAT_STOP;
                        }
                    }
                    break;
                case I2C_STAT_STOP:
                    status = i2c_stop();
                    if( status == STATUS_OK ){
                        i2c_data.status = I2C_STAT_END;
                    }
                    break;
                default:
                    LOG_PRINT_I2C("ERROR (line%d) STATUS = %d\r\n",__LINE__,i2c_data.status);
                    
                    break;
            }
            
            if( status == STATUS_OK ){
                if( i2c_data.status == I2C_STAT_END ){
                    // 正常終了
                    //SetLogDataM( LOG_DISP_NO_DATA, "I2C END",0,0,0,0);
                    break;
                }
            }
            else{
                // リカバリー処理　今は強制終了
                I2C_ON = 0;
                // 割込みフラグクリア
                I2C_BIF = 0;
                I2C_MIF = 0;

        
        
            
                //Wait(1);
                
                if(i2c_data.restart_cnt < I2C_RECOVRY_MAX){
                    i2c_data.restart_cnt ++;

                    
                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    // I2C START
                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    I2C_ON = 1;

                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    // データ設定
                    //++++++++++++++++++++++++++++++++++++++++++++++++++
                    status = STATUS_OK;

                    i2c_data.count_step = 0;
                    i2c_data.status = I2C_STAT_START;
                    i2c_data.error = I2C_NO_ERROR;

                    // 割込みフラグクリア
                    I2C_BIF = 0;
                    I2C_MIF = 0;

                    // 割込みイネーブル
                    I2C_BIE = 0;
                    I2C_MIE = 0;
        
        

                    
                    LOG_PRINT_I2C( "RESTART\r\n");
                }
                else{
                    LOG_PRINT_I2C( "ERROR_END\r\n");
                }
            }
        }
    }   

    return  status;
}       
//=============================================================================
//
//=============================================================================
int32_t i2c_readMulti(uint8_t address,uint8_t reg, uint8_t *dst, uint8_t count)
{
    uint8_t i;
    uint8_t acknack;
    uint8_t status;
    
    status = STATUS_OK ;    


    if( count > MAX_MULTI_CNT ){
        LOG_PRINT_I2C("Error I2CData Size Over");
        status = STATUS_FAIL;          
    }
    else{
        
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        // I2C START
        //++++++++++++++++++++++++++++++++++++++++++++++++++
        I2C_ON = 1;
        I2C_ACKDT =0;

